#include "ModbusTCP.h"

int main()
{
	string recvData = "";

	ModbusTCP modbus;
	modbus.OpenModbusTCP("192.168.1.5");//192.168.1.5
	modbus.SendModbusData("00050504FF00");//写入单个线圈：00050501FF00     写入多个线圈：000F05000010028285
	modbus.RecvModbusData(&recvData);
	modbus.CloseModbusTCP();
	

	system("pause");
	return 0;
}



//闭合：000505**FF00，其中**为对应Output口的十六进制
//断开：000505**0000，其中**为对应Output口的十六进制

/*
定义IO口的映射
闭合：000505**FF00，其中**为对应Output口的十六进制
断开：000505**0000，其中**为对应Output口的十六进制
二五夹紧1----Y0----闭合（出气）：00050500FF00----断开：000505000000
二五松开2----Y1----闭合：00050501FF00----断开：000505010000
多吸盘------ - Y2----闭合（出气）：00050502FF00----断开（不出气）：000505020000
中心-------- - Y3----闭合：00050503FF00----断开：000505030000
光源-------- - Y4----闭合：00050504FF00----断开：000505040000

夹紧：Y0 = 1，Y1 = 0:000F05000010020100
松开：Y0 = 0，Y1 = 1 : 000F05000010020200
*/
